; domain
;; Domain file for the Delivery Robot problem
(define (domain delivery-robot)
  (:requirements :strips :typing :negative-preconditions)
  
  (:types
    location - object
    package - object
    robot - object
  )
  
  (:predicates
    (at ?obj - object ?loc - location)    ; Object is at location
    (connected ?loc1 ?loc2 - location)    ; Locations are connected (can move between them)
    (carrying ?r - robot ?p - package)    ; Robot is carrying a package
    (destination ?p - package ?loc - location)  ; Package's destination is location
    (delivered ?p - package)              ; Package has been delivered
  )
  
  (:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and 
                    (at ?r ?from)
                    (connected ?from ?to)
                  )
    :effect (and 
              (not (at ?r ?from))
              (at ?r ?to)
            )
  )
  
  (:action pick-up
    :parameters (?r - robot ?p - package ?loc - location)
    :precondition (and 
                    (at ?r ?loc)
                    (at ?p ?loc)
                    (not (exists (?p2 - package) (carrying ?r ?p2)))
                  )
    :effect (and 
              (carrying ?r ?p)
              (not (at ?p ?loc))
            )
  )
  
  (:action drop
    :parameters (?r - robot ?p - package ?loc - location)
    :precondition (and 
                    (at ?r ?loc)
                    (carrying ?r ?p)
                  )
    :effect (and 
              (not (carrying ?r ?p))
              (at ?p ?loc)
            )
  )
  
  (:action deliver
    :parameters (?r - robot ?p - package ?loc - location)
    :precondition (and 
                    (at ?r ?loc)
                    (carrying ?r ?p)
                    (destination ?p ?loc)
                  )
    :effect (and 
              (not (carrying ?r ?p))
              (delivered ?p)
            )
  )
)

; problem
;; Problem file for the Delivery Robot domain
(define (problem delivery-problem-1)
  (:domain delivery-robot)
  
  (:objects
    robot1 - robot
    package1 package2 package3 - package
    office1 office2 office3 lab kitchen - location
  )
  
  (:init
    ;; Robot initial location
    (at robot1 office1)
    
    ;; Package initial locations
    (at package1 office2)
    (at package2 lab)
    (at package3 office1)
    
    ;; Package destinations
    (destination package1 kitchen)
    (destination package2 office3)
    (destination package3 lab)
    
    ;; Building layout - connections between locations
    (connected office1 office2)
    (connected office2 office1)
    (connected office2 office3)
    (connected office3 office2)
    (connected office3 lab)
    (connected lab office3)
    (connected lab kitchen)
    (connected kitchen lab)
    (connected kitchen office1)
    (connected office1 kitchen)
  )
  
  (:goal
    (and
      (delivered package1)
      (delivered package2)
      (delivered package3)
    )
  )
)

; plan
1. (pick-up robot1 package3 office1)
   deleted: (at package3 office1)
   added: (carrying robot1 package3)
   goals met: 0 of 3
2. (move robot1 office1 office2)
   deleted: (at robot1 office1)
   added: (at robot1 office2)
   goals met: 0 of 3
3. (move robot1 office2 office3)
   deleted: (at robot1 office2)
   added: (at robot1 office3)
   goals met: 0 of 3
4. (move robot1 office3 lab)
   deleted: (at robot1 office3)
   added: (at robot1 lab)
   goals met: 0 of 3
5. (deliver robot1 package3 lab)
   deleted: (carrying robot1 package3)
   added: (delivered package3)
   goals met: 1 of 3
6. (pick-up robot1 package2 lab)
   deleted: (at package2 lab)
   added: (carrying robot1 package2)
   goals met: 1 of 3
7. (move robot1 lab office3)
   deleted: (at robot1 lab)
   added: (at robot1 office3)
   goals met: 1 of 3
8. (deliver robot1 package2 office3)
   deleted: (carrying robot1 package2)
   added: (delivered package2)
   goals met: 2 of 3
9. (move robot1 office3 office2)
   deleted: (at robot1 office3)
   added: (at robot1 office2)
   goals met: 2 of 3
10. (pick-up robot1 package1 office2)
   deleted: (at package1 office2)
   added: (carrying robot1 package1)
   goals met: 2 of 3
11. (move robot1 office2 office1)
   deleted: (at robot1 office2)
   added: (at robot1 office1)
   goals met: 2 of 3
12. (move robot1 office1 kitchen)
   deleted: (at robot1 office1)
   added: (at robot1 kitchen)
   goals met: 2 of 3
13. (deliver robot1 package1 kitchen)
   deleted: (carrying robot1 package1)
   added: (delivered package1)
   goals met: 3 of 3
